Projects/Demo/output/sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Creating table 'sbtest1'...
Inserting 10000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 10000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 10000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 10000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 10000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 10000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 10000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 10000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 10000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 10000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1 tps: 1119.32 qps: 22405.27 (r/w/o: 15684.39/4481.25/2239.63) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1 tps: 1189.12 qps: 23764.40 (r/w/o: 16633.68/4752.48/2378.24) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1 tps: 1254.86 qps: 25115.26 (r/w/o: 17582.08/5023.45/2509.73) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1 tps: 1262.91 qps: 25249.26 (r/w/o: 17675.78/5047.65/2525.83) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1 tps: 1277.54 qps: 25559.74 (r/w/o: 17890.51/5114.15/2555.07) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1 tps: 1271.42 qps: 25417.38 (r/w/o: 17792.86/5081.68/2542.84) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1 tps: 1275.95 qps: 25516.00 (r/w/o: 17860.30/5103.80/2551.90) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1 tps: 1252.81 qps: 25051.16 (r/w/o: 17535.31/5011.23/2504.62) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1 tps: 1236.45 qps: 24739.99 (r/w/o: 17320.29/4945.80/2473.90) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            173488
        write:                           49568
        other:                           24784
        total:                           247840
    transactions:                        12392  (1239.10 per sec.)
    queries:                             247840 (24781.91 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0006s
    total number of events:              12392

Latency (ms):
         min:                                    0.69
         avg:                                    0.81
         max:                                    3.50
         95th percentile:                        0.00
         sum:                                 9995.93

Threads fairness:
    events (avg/stddev):           12392.0000/0.00
    execution time (avg/stddev):   9.9959/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...