Projects/Demo/output/sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Creating table 'sbtest1'...
Inserting 10000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 10000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 10000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 10000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 10000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 10000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 10000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 10000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 10000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 10000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1 tps: 1393.29 qps: 27882.85 (r/w/o: 19520.09/5575.17/2787.59) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1 tps: 1494.08 qps: 29882.54 (r/w/o: 20917.08/5977.30/2988.15) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1 tps: 1539.96 qps: 30800.29 (r/w/o: 21559.50/6160.86/3079.93) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1 tps: 1538.58 qps: 30771.51 (r/w/o: 21540.06/6154.30/3077.15) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1 tps: 1541.62 qps: 30819.43 (r/w/o: 21573.70/6162.48/3083.25) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1 tps: 1577.35 qps: 31560.09 (r/w/o: 22091.96/6313.42/3154.71) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1 tps: 1582.30 qps: 31639.95 (r/w/o: 22150.15/6325.20/3164.59) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1 tps: 1584.03 qps: 31684.54 (r/w/o: 22178.38/6338.11/3168.05) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1 tps: 1590.40 qps: 31800.05 (r/w/o: 22259.63/6359.61/3180.80) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            216244
        write:                           61784
        other:                           30892
        total:                           308920
    transactions:                        15446  (1544.48 per sec.)
    queries:                             308920 (30889.54 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0006s
    total number of events:              15446

Latency (ms):
         min:                                    0.55
         avg:                                    0.65
         max:                                    4.47
         95th percentile:                        0.00
         sum:                                 9996.34

Threads fairness:
    events (avg/stddev):           15446.0000/0.00
    execution time (avg/stddev):   9.9963/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...