Projects/Demo/output/sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Creating table 'sbtest1'...
Inserting 10000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 10000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 10000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 10000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 10000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 10000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 10000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 10000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 10000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 10000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1 tps: 1299.18 qps: 25994.50 (r/w/o: 18198.45/5196.70/2599.35) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1 tps: 1434.65 qps: 28693.03 (r/w/o: 20085.12/5738.61/2869.30) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1 tps: 1366.62 qps: 27331.44 (r/w/o: 19131.71/5466.49/2733.24) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1 tps: 1407.12 qps: 28151.34 (r/w/o: 19704.64/5632.47/2814.23) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1 tps: 1408.20 qps: 28153.96 (r/w/o: 19708.77/5628.79/2816.40) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1 tps: 1387.51 qps: 27749.11 (r/w/o: 19424.08/5550.02/2775.01) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1 tps: 1450.23 qps: 29005.57 (r/w/o: 20304.20/5800.91/2900.46) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1 tps: 1445.02 qps: 28893.50 (r/w/o: 20223.35/5780.10/2890.05) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1 tps: 1461.52 qps: 29236.47 (r/w/o: 20467.33/5846.09/2923.05) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 1519.20 qps: 30376.05 (r/w/o: 21261.83/6076.81/3037.40) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            198520
        write:                           56720
        other:                           28360
        total:                           283600
    transactions:                        14180  (1417.85 per sec.)
    queries:                             283600 (28357.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0009s
    total number of events:              14180

Latency (ms):
         min:                                    0.56
         avg:                                    0.70
         max:                                    4.90
         95th percentile:                        0.00
         sum:                                 9995.76

Threads fairness:
    events (avg/stddev):           14180.0000/0.00
    execution time (avg/stddev):   9.9958/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...